# InternalDefinition Members (2023)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2023 API
---
InternalDefinition Members
InternalDefinition Class Methods Properties See Also
---
The InternalDefinition type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Dispose | Releases all resources used by the InternalDefinition |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetDataType | Gets a ForgeTypeId identifying the data type describing values of the parameter.  (Inherited from Definition.) |
| GetGroupTypeId | Gets the identifier of the built-in parameter group to which the parameter defined by this definition belongs. (Overrides Definition..::..GetGroupTypeId()()()().) |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetParameterTypeId | Tests whether this definition identifies a built-in parameter or not. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Gets the identifier of the parameter. |
| SetAllowVaryBetweenGroups | Whether or not the parameter values can vary across group members. |
| SetGroupTypeId | Sets the built-in parameter group to which the parameter defined by this definition belongs. |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| BuiltInParameter | Tests whether this definition identifies a built-in parameter or not. |
| Id | The id of the parameter. |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
| Name | The user-visible name for the parameter. (Overrides Definition..::..Name.) |
| ParameterGroup | Id of a built-in parameter group to which the parameter defined by this definition belongs. (Overrides Definition..::..ParameterGroup.) |
| VariesAcrossGroups | Whether or not the parameter values can vary across group members. |
| Visible | Indicates if the parameter is visible in the Autodesk Revit user interface. |

# See Also
InternalDefinition Class
Autodesk.Revit.DB Namespace